{
	"id": "94",
	"name": "Improper Control of Generation of Code ('Code Injection')",
	"abstraction": "Base",
	"structure": "Simple",
	"status": "Draft",
	"description": "The product constructs all or part of a code segment using externally-influenced input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could modify the syntax or behavior of the intended code segment.",
	"extended_description": "\n            <xhtml:p>When a product allows a user's input to contain code syntax, it might be possible for an attacker to craft the code in such a way that it will alter the intended control flow of the product. Such an alteration could lead to arbitrary code execution.</xhtml:p>\n            <xhtml:p>Injection problems encompass a wide variety of issues -- all mitigated in very different ways. For this reason, the most effective way to discuss these weaknesses is to note the distinct features which classify them as injection weaknesses. The most important issue to note is that all injection problems share one thing in common -- i.e., they allow for the injection of control plane data into the user-controlled data plane. This means that the execution of the process may be altered by sending code in through legitimate data channels, using no other mechanism. While buffer overflows, and many other flaws, involve the use of some further issue to gain execution, injection problems need only for the data to be parsed. The most classic instantiations of this category of weakness are SQL injection and format string vulnerabilities.</xhtml:p>\n         ",
	"related_weaknesses": [
		{
			"nature": "ChildOf",
			"cweid": "74",
			"view_id": "1000",
			"ordinal": "Primary"
		},
		{
			"nature": "ChildOf",
			"cweid": "74",
			"view_id": "1003",
			"ordinal": "Primary"
		},
		{
			"nature": "ChildOf",
			"cweid": "913",
			"view_id": "1000"
		}
	],
	"applicable_platforms": {
		"language": [
			{
				"class": "Interpreted",
				"prevalence": "Sometimes"
			}
		],
		"technology": [
			{
				"prevalence": "Undetermined",
				"name": "AI/ML"
			}
		]
	},
	"modes_of_introduction": [
		{
			"phase": "Implementation",
			"note": [
				"REALIZATION: This weakness is caused during implementation of an architectural security tactic."
			]
		}
	],
	"likelihood_of_exploit": "Medium",
	"common_consequences": [
		{
			"scope": [
				"Access Control"
			],
			"impact": [
				"Bypass Protection Mechanism"
			],
			"note": "In some cases, injectable code controls authentication; this may lead to a remote vulnerability."
		},
		{
			"scope": [
				"Access Control"
			],
			"impact": [
				"Gain Privileges or Assume Identity"
			],
			"note": "Injected code can access resources that the attacker is directly prevented from accessing."
		},
		{
			"scope": [
				"Integrity",
				"Confidentiality",
				"Availability"
			],
			"impact": [
				"Execute Unauthorized Code or Commands"
			],
			"note": "Code injection attacks can lead to loss of data integrity in nearly all cases as the control-plane data injected is always incidental to data recall or writing. Additionally, code injection can often result in the execution of arbitrary code."
		},
		{
			"scope": [
				"Non-Repudiation"
			],
			"impact": [
				"Hide Activities"
			],
			"note": "Often the actions performed by injected control code are unlogged."
		}
	],
	"potential_mitigations": [
		{
			"phase": [
				"Architecture and Design"
			],
			"description": [
				"Refactor your program so that you do not have to dynamically generate code."
			]
		},
		{
			"phase": [
				"Architecture and Design"
			],
			"description": [
				"\n                  <xhtml:p>Run your code in a \"jail\" or similar sandbox environment that enforces strict boundaries between the process and the operating system. This may effectively restrict which code can be executed by your product.</xhtml:p>\n                  <xhtml:p>Examples include the Unix chroot jail and AppArmor. In general, managed code may provide some protection.</xhtml:p>\n                  <xhtml:p>This may not be a feasible solution, and it only limits the impact to the operating system; the rest of your application may still be subject to compromise.</xhtml:p>\n                  <xhtml:p>Be careful to avoid CWE-243 and other weaknesses related to jails.</xhtml:p>\n               "
			]
		},
		{
			"mitigation_id": "MIT-5",
			"phase": [
				"Implementation"
			],
			"description": [
				"\n                  <xhtml:p>Assume all input is malicious. Use an \"accept known good\" input validation strategy, i.e., use a list of acceptable inputs that strictly conform to specifications. Reject any input that does not strictly conform to specifications, or transform it into something that does.</xhtml:p>\n                  <xhtml:p>When performing input validation, consider all potentially relevant properties, including length, type of input, the full range of acceptable values, missing or extra inputs, syntax, consistency across related fields, and conformance to business rules. As an example of business rule logic, \"boat\" may be syntactically valid because it only contains alphanumeric characters, but it is not valid if the input is only expected to contain colors such as \"red\" or \"blue.\"</xhtml:p>\n                  <xhtml:p>Do not rely exclusively on looking for malicious or malformed inputs.  This is likely to miss at least one undesirable input, especially if the code's environment changes. This can give attackers enough room to bypass the intended validation. However, denylists can be useful for detecting potential attacks or determining which inputs are so malformed that they should be rejected outright.</xhtml:p>\n                  <xhtml:p>To reduce the likelihood of code injection, use stringent allowlists that limit which constructs are allowed. If you are dynamically constructing code that invokes a function, then verifying that the input is alphanumeric might be insufficient. An attacker might still be able to reference a dangerous function that you did not intend to allow, such as system(), exec(), or exit().</xhtml:p>\n               "
			],
			"strategy": "Input Validation"
		},
		{
			"phase": [
				"Testing"
			],
			"description": [
				"Use automated static analysis tools that target this type of weakness. Many modern techniques use data flow analysis to minimize the number of false positives. This is not a perfect solution, since 100% accuracy and coverage are not feasible."
			]
		},
		{
			"phase": [
				"Testing"
			],
			"description": [
				"Use dynamic tools and techniques that interact with the product using large test suites with many diverse inputs, such as fuzz testing (fuzzing), robustness testing, and fault injection. The product's operation may slow down, but it should not become unstable, crash, or generate incorrect results."
			]
		},
		{
			"mitigation_id": "MIT-32",
			"phase": [
				"Operation"
			],
			"description": [
				"Run the code in an environment that performs automatic taint propagation and prevents any command execution that uses tainted variables, such as Perl's \"-T\" switch. This will force the program to perform validation steps that remove the taint, although you must be careful to correctly validate your inputs so that you do not accidentally mark dangerous inputs as untainted (see CWE-183 and CWE-184)."
			],
			"strategy": "Compilation or Build Hardening"
		},
		{
			"mitigation_id": "MIT-32",
			"phase": [
				"Operation"
			],
			"description": [
				"Run the code in an environment that performs automatic taint propagation and prevents any command execution that uses tainted variables, such as Perl's \"-T\" switch. This will force the program to perform validation steps that remove the taint, although you must be careful to correctly validate your inputs so that you do not accidentally mark dangerous inputs as untainted (see CWE-183 and CWE-184)."
			],
			"strategy": "Environment Hardening"
		},
		{
			"phase": [
				"Implementation"
			],
			"description": [
				"\n                  <xhtml:p>For Python programs, it is frequently encouraged to use the ast.literal_eval() function instead of eval, since it is intentionally designed to avoid executing code. However, an adversary could still cause excessive memory or stack consumption via deeply nested structures [REF-1372], so the python documentation discourages use of ast.literal_eval() on untrusted data [REF-1373].</xhtml:p>\n               "
			],
			"effectiveness": "Discouraged Common Practice"
		}
	],
	"demonstrative_examples": [
		{
			"demonstrative_example_id": "DX-32",
			"text": "\n               <Intro_Text>This example attempts to write user messages to a message file and allow users to view them.</Intro_Text>\n               <Example_Code Nature=\"Bad\" Language=\"PHP\">\n                  <xhtml:div>$MessageFile = \"messages.out\";<xhtml:br/>if ($_GET[\"action\"] == \"NewMessage\") {<xhtml:div style=\"margin-left:1em;\">$name = $_GET[\"name\"];<xhtml:br/>$message = $_GET[\"message\"];<xhtml:br/>$handle = fopen($MessageFile, \"a+\");<xhtml:br/>fwrite($handle, \"&lt;b&gt;$name&lt;/b&gt; says '$message'&lt;hr&gt;\\n\");<xhtml:br/>fclose($handle);<xhtml:br/>echo \"Message Saved!&lt;p&gt;\\n\";</xhtml:div>}<xhtml:br/>else if ($_GET[\"action\"] == \"ViewMessages\") {<xhtml:div style=\"margin-left:1em;\">include($MessageFile);</xhtml:div>}</xhtml:div>\n               </Example_Code>\n               <Body_Text>While the programmer intends for the MessageFile to only include data, an attacker can provide a message such as:</Body_Text>\n               <Example_Code Nature=\"Attack\">\n                  <xhtml:div>name=h4x0r<xhtml:br/>message=%3C?php%20system(%22/bin/ls%20-l%22);?%3E</xhtml:div>\n               </Example_Code>\n               <Body_Text>which will decode to the following:</Body_Text>\n               <Example_Code Nature=\"Attack\">\n                  <xhtml:div>&lt;?php system(\"/bin/ls -l\");?&gt;</xhtml:div>\n               </Example_Code>\n               <Body_Text>The programmer thought they were just including the contents of a regular data file, but PHP parsed it and executed the code. Now, this code is executed any time people view messages.</Body_Text>\n               <Body_Text>Notice that XSS (CWE-79) is also possible in this situation.</Body_Text>\n            "
		},
		{
			"demonstrative_example_id": "DX-31",
			"text": "\n               <Intro_Text>edit-config.pl: This CGI script is used to modify settings in a configuration file.</Intro_Text>\n               <Example_Code Nature=\"Bad\" Language=\"Perl\">\n                  <xhtml:div>use CGI qw(:standard);<xhtml:br/>\n                     <xhtml:br/>sub config_file_add_key {<xhtml:div style=\"margin-left:1em;\">\n                        <xhtml:div>my ($fname, $key, $arg) = @_;<xhtml:br/>\n                           <xhtml:br/>\n                           <xhtml:i># code to add a field/key to a file goes here</xhtml:i>\n                           <xhtml:br/>\n                        </xhtml:div>\n                     </xhtml:div>}<xhtml:br/>\n                     <xhtml:br/>sub config_file_set_key {<xhtml:div style=\"margin-left:1em;\">\n                        <xhtml:div>my ($fname, $key, $arg) = @_;<xhtml:br/>\n                           <xhtml:br/>\n                           <xhtml:i># code to set key to a particular file goes here</xhtml:i>\n                           <xhtml:br/>\n                        </xhtml:div>\n                     </xhtml:div>}<xhtml:br/>\n                     <xhtml:br/>sub config_file_delete_key {<xhtml:div style=\"margin-left:1em;\">\n                        <xhtml:div>my ($fname, $key, $arg) = @_;<xhtml:br/>\n                           <xhtml:br/>\n                           <xhtml:i># code to delete key from a particular file goes here</xhtml:i>\n                           <xhtml:br/>\n                        </xhtml:div>\n                     </xhtml:div>}<xhtml:br/>\n                     <xhtml:br/>sub handleConfigAction {<xhtml:div style=\"margin-left:1em;\">\n                        <xhtml:div>my ($fname, $action) = @_;<xhtml:br/>my $key = param('key');<xhtml:br/>my $val = param('val');<xhtml:br/>\n                           <xhtml:br/>\n                           <xhtml:i># this is super-efficient code, especially if you have to invoke</xhtml:i>\n                           <xhtml:br/>\n                           <xhtml:br/>\n                           <xhtml:br/>\n                           <xhtml:i># any one of dozens of different functions!</xhtml:i>\n                           <xhtml:br/>\n                           <xhtml:br/>my $code = \"config_file_$action_key(\\$fname, \\$key, \\$val);\";<xhtml:br/>eval($code);</xhtml:div>\n                     </xhtml:div>}<xhtml:br/>\n                     <xhtml:br/>$configfile = \"/home/cwe/config.txt\";<xhtml:br/>print header;<xhtml:br/>if (defined(param('action'))) {<xhtml:div style=\"margin-left:1em;\">handleConfigAction($configfile, param('action'));</xhtml:div>}<xhtml:br/>else {<xhtml:div style=\"margin-left:1em;\">print \"No action specified!\\n\";</xhtml:div>}</xhtml:div>\n               </Example_Code>\n               <Body_Text>The script intends to take the 'action' parameter and invoke one of a variety of functions based on the value of that parameter - config_file_add_key(), config_file_set_key(), or config_file_delete_key(). It could set up a conditional to invoke each function separately, but eval() is a powerful way of doing the same thing in fewer lines of code, especially when a large number of functions or variables are involved. Unfortunately, in this case, the attacker can provide other values in the action parameter, such as:</Body_Text>\n               <Example_Code Nature=\"Attack\">\n                  <xhtml:div>add_key(\",\",\"); system(\"/bin/ls\");</xhtml:div>\n               </Example_Code>\n               <Body_Text>This would produce the following string in handleConfigAction():</Body_Text>\n               <Example_Code Nature=\"Result\">\n                  <xhtml:div>config_file_add_key(\",\",\"); system(\"/bin/ls\");</xhtml:div>\n               </Example_Code>\n               <Body_Text>Any arbitrary Perl code could be added after the attacker has \"closed off\" the construction of the original function call, in order to prevent parsing errors from causing the malicious eval() to fail before the attacker's payload is activated. This particular manipulation would fail after the system() call, because the \"_key(\\$fname, \\$key, \\$val)\" portion of the string would cause an error, but this is irrelevant to the attack because the payload has already been activated.</Body_Text>\n            "
		},
		{
			"demonstrative_example_id": "DX-156",
			"text": "\n              <Intro_Text>This simple script asks a user to supply a list of numbers as input and adds them together.</Intro_Text>\n              <Example_Code Nature=\"Bad\" Language=\"Python\">\n                <xhtml:div>\n                  def main():<xhtml:br/>\n                  <xhtml:div style=\"margin-left:1em;\">\n                    sum = 0<xhtml:br/>\n                    numbers = eval(input(\"Enter a space-separated list of numbers: \"))<xhtml:br/>\n                    for num in numbers:<xhtml:br/>\n                    <xhtml:div style=\"margin-left:1em;\">\n                      sum = sum + num<xhtml:br/>\n                    </xhtml:div>\n                    print(f\"Sum of {numbers} = {sum}\")\n                  </xhtml:div>\n                  main()\n                </xhtml:div>\n              </Example_Code>\n              <Body_Text>The eval() function can take the user-supplied list and convert it into a Python list object, therefore allowing the programmer to use list comprehension methods to work with the data. However, if code is supplied to the eval() function, it will execute that code. For example, a malicious user could supply the following string:</Body_Text>\n              <Example_Code Nature=\"Attack\">\n                <xhtml:div>__import__('subprocess').getoutput('rm -r *')</xhtml:div>\n              </Example_Code>\n              <Body_Text>This would delete all the files in the current directory. For this reason, it is not recommended to use eval() with untrusted input.</Body_Text>\n\t      <Body_Text>A way to accomplish this without the use of eval() is to apply an integer conversion on the input within a try/except block. If the user-supplied input is not numeric, this will raise a ValueError. By avoiding eval(), there is no opportunity for the input string to be executed as code.</Body_Text>\n              <Example_Code Nature=\"Good\" Language=\"Python\">\n                <xhtml:div>\n                  def main():<xhtml:br/>\n                  <xhtml:div style=\"margin-left:1em;\">\n                    sum = 0<xhtml:br/>\n                    numbers = input(\"Enter a space-separated list of numbers: \").split(\" \")<xhtml:br/>\n                    try:<xhtml:br/>\n                    <xhtml:div style=\"margin-left:1em;\">\n                      for num in numbers:<xhtml:br/>\n                      <xhtml:div style=\"margin-left:1em;\">\n                        sum = sum + int(num)<xhtml:br/>\n                      </xhtml:div>\n                      print(f\"Sum of {numbers} = {sum}\")\n                    </xhtml:div>\n                    except ValueError:<xhtml:br/>\n                    <xhtml:div style=\"margin-left:1em;\">\n                      print(\"Error: invalid input\")<xhtml:br/>\n                    </xhtml:div>\n                  </xhtml:div>\n                  main()\n                </xhtml:div>\n              </Example_Code>\n              <Body_Text>An alternative, commonly-cited mitigation for this kind of weakness is to use the ast.literal_eval() function, since it is intentionally designed to avoid executing code. However, an adversary could still cause excessive memory or stack consumption via deeply nested structures [REF-1372], so the python documentation discourages use of ast.literal_eval() on untrusted data [REF-1373].</Body_Text>\n            "
		}
	],
	"observed_examples": [
		{
			"reference": "CVE-2023-29374",
			"description": "Math component in an LLM framework translates user input into a Python\n\t\t\t   expression that is input into the Python exec() method, allowing code\n\t\t\t   execution - one variant of a \"prompt injection\" attack.",
			"link": "https://www.cve.org/CVERecord?id=CVE-2023-29374"
		},
		{
			"reference": "CVE-2024-5565",
			"description": "Python-based library uses an LLM prompt containing user input to\n\t\t\t   dynamically generate code that is then fed as input into the Python\n\t\t\t   exec() method, allowing code execution - one variant of a \"prompt\n\t\t\t   injection\" attack.",
			"link": "https://www.cve.org/CVERecord?id=CVE-2024-5565"
		},
		{
			"reference": "CVE-2024-4181",
			"description": "Framework for LLM applications allows eval injection via a crafted response from a hosting provider.",
			"link": "https://www.cve.org/CVERecord?id=CVE-2024-4181"
		},
		{
			"reference": "CVE-2022-2054",
			"description": "Python compiler uses eval() to execute malicious strings as Python code.",
			"link": "https://www.cve.org/CVERecord?id=CVE-2022-2054"
		},
		{
			"reference": "CVE-2021-22204",
			"description": "Chain: regex in EXIF processor code does not correctly determine where a string ends (CWE-625), enabling eval injection (CWE-95), as exploited in the wild per CISA KEV.",
			"link": "https://www.cve.org/CVERecord?id=CVE-2021-22204"
		},
		{
			"reference": "CVE-2020-8218",
			"description": "\"Code injection\" in VPN product, as exploited in the wild per CISA KEV.",
			"link": "https://www.cve.org/CVERecord?id=CVE-2020-8218"
		},
		{
			"reference": "CVE-2008-5071",
			"description": "Eval injection in PHP program.",
			"link": "https://www.cve.org/CVERecord?id=CVE-2008-5071"
		},
		{
			"reference": "CVE-2002-1750",
			"description": "Eval injection in Perl program.",
			"link": "https://www.cve.org/CVERecord?id=CVE-2002-1750"
		},
		{
			"reference": "CVE-2008-5305",
			"description": "Eval injection in Perl program using an ID that should only contain hyphens and numbers.",
			"link": "https://www.cve.org/CVERecord?id=CVE-2008-5305"
		},
		{
			"reference": "CVE-2002-1752",
			"description": "Direct code injection into Perl eval function.",
			"link": "https://www.cve.org/CVERecord?id=CVE-2002-1752"
		},
		{
			"reference": "CVE-2002-1753",
			"description": "Eval injection in Perl program.",
			"link": "https://www.cve.org/CVERecord?id=CVE-2002-1753"
		},
		{
			"reference": "CVE-2005-1527",
			"description": "Direct code injection into Perl eval function.",
			"link": "https://www.cve.org/CVERecord?id=CVE-2005-1527"
		},
		{
			"reference": "CVE-2005-2837",
			"description": "Direct code injection into Perl eval function.",
			"link": "https://www.cve.org/CVERecord?id=CVE-2005-2837"
		},
		{
			"reference": "CVE-2005-1921",
			"description": "MFV. code injection into PHP eval statement using nested constructs that should not be nested.",
			"link": "https://www.cve.org/CVERecord?id=CVE-2005-1921"
		},
		{
			"reference": "CVE-2005-2498",
			"description": "MFV. code injection into PHP eval statement using nested constructs that should not be nested.",
			"link": "https://www.cve.org/CVERecord?id=CVE-2005-2498"
		},
		{
			"reference": "CVE-2005-3302",
			"description": "Code injection into Python eval statement from a field in a formatted file.",
			"link": "https://www.cve.org/CVERecord?id=CVE-2005-3302"
		},
		{
			"reference": "CVE-2007-1253",
			"description": "Eval injection in Python program.",
			"link": "https://www.cve.org/CVERecord?id=CVE-2007-1253"
		},
		{
			"reference": "CVE-2001-1471",
			"description": "chain: Resultant eval injection. An invalid value prevents initialization of variables, which can be modified by attacker and later injected into PHP eval statement.",
			"link": "https://www.cve.org/CVERecord?id=CVE-2001-1471"
		},
		{
			"reference": "CVE-2002-0495",
			"description": "Perl code directly injected into CGI library file from parameters to another CGI program.",
			"link": "https://www.cve.org/CVERecord?id=CVE-2002-0495"
		},
		{
			"reference": "CVE-2005-1876",
			"description": "Direct PHP code injection into supporting template file.",
			"link": "https://www.cve.org/CVERecord?id=CVE-2005-1876"
		},
		{
			"reference": "CVE-2005-1894",
			"description": "Direct code injection into PHP script that can be accessed by attacker.",
			"link": "https://www.cve.org/CVERecord?id=CVE-2005-1894"
		},
		{
			"reference": "CVE-2003-0395",
			"description": "PHP code from User-Agent HTTP header directly inserted into log file implemented as PHP script.",
			"link": "https://www.cve.org/CVERecord?id=CVE-2003-0395"
		}
	],
	"references": [
		{
			"section": "\"Sin 3: Web-Client Related Vulnerabilities (XSS).\" Page 63",
			"reference_id": "REF-44",
			"author": [
				"Michael Howard",
				"David LeBlanc",
				"John Viega"
			],
			"title": "24 Deadly Sins of Software Security",
			"publication_year": "2010",
			"publication": "McGraw-Hill"
		},
		{
			"reference_id": "REF-1372",
			"title": "How ast.literal_eval can cause memory exhaustion",
			"url": "https://www.reddit.com/r/learnpython/comments/zmbhcf/how_astliteral_eval_can_cause_memory_exhaustion/",
			"publication_year": "2022",
			"publication_month": "--12",
			"publication_day": "---14",
			"publisher": "Reddit",
			"url_date": "2023-11-03"
		},
		{
			"section": "ast.literal_eval(node_or_string)",
			"reference_id": "REF-1373",
			"title": "ast - Abstract Syntax Trees",
			"url": "https://docs.python.org/3/library/ast.html#ast.literal_eval",
			"publication_year": "2023",
			"publication_month": "--11",
			"publication_day": "---02",
			"publisher": "Python",
			"url_date": "2023-11-03"
		}
	],
	"content_history": {
		"submission": {
			"submission_name": "PLOVER",
			"submission_date": "2006-07-19"
		},
		"modification": [
			{
				"modification_name": "Eric Dalci",
				"modification_organization": "Cigital",
				"modification_date": "2008-07-01",
				"modification_comment": "updated Time_of_Introduction"
			},
			{
				"modification_name": "CWE Content Team",
				"modification_organization": "MITRE",
				"modification_date": "2008-09-08",
				"modification_comment": "updated Applicable_Platforms, Relationships, Research_Gaps, Taxonomy_Mappings"
			},
			{
				"modification_name": "CWE Content Team",
				"modification_organization": "MITRE",
				"modification_date": "2009-01-12",
				"modification_comment": "updated Common_Consequences, Demonstrative_Examples, Description, Likelihood_of_Exploit, Name, Potential_Mitigations, Relationships"
			},
			{
				"modification_name": "CWE Content Team",
				"modification_organization": "MITRE",
				"modification_date": "2009-03-10",
				"modification_comment": "updated Potential_Mitigations"
			},
			{
				"modification_name": "CWE Content Team",
				"modification_organization": "MITRE",
				"modification_date": "2009-05-27",
				"modification_comment": "updated Demonstrative_Examples, Name"
			},
			{
				"modification_name": "CWE Content Team",
				"modification_organization": "MITRE",
				"modification_date": "2010-02-16",
				"modification_comment": "updated Potential_Mitigations"
			},
			{
				"modification_name": "CWE Content Team",
				"modification_organization": "MITRE",
				"modification_date": "2010-06-21",
				"modification_comment": "updated Description, Potential_Mitigations"
			},
			{
				"modification_name": "CWE Content Team",
				"modification_organization": "MITRE",
				"modification_date": "2011-03-29",
				"modification_comment": "updated Name"
			},
			{
				"modification_name": "CWE Content Team",
				"modification_organization": "MITRE",
				"modification_date": "2011-06-01",
				"modification_comment": "updated Common_Consequences"
			},
			{
				"modification_name": "CWE Content Team",
				"modification_organization": "MITRE",
				"modification_date": "2012-05-11",
				"modification_comment": "updated Common_Consequences, Demonstrative_Examples, Observed_Examples, References, Relationships"
			},
			{
				"modification_name": "CWE Content Team",
				"modification_organization": "MITRE",
				"modification_date": "2012-10-30",
				"modification_comment": "updated Potential_Mitigations"
			},
			{
				"modification_name": "CWE Content Team",
				"modification_organization": "MITRE",
				"modification_date": "2013-02-21",
				"modification_comment": "updated Relationships"
			},
			{
				"modification_name": "CWE Content Team",
				"modification_organization": "MITRE",
				"modification_date": "2014-07-30",
				"modification_comment": "updated Relationships"
			},
			{
				"modification_name": "CWE Content Team",
				"modification_organization": "MITRE",
				"modification_date": "2015-12-07",
				"modification_comment": "updated Relationships"
			},
			{
				"modification_name": "CWE Content Team",
				"modification_organization": "MITRE",
				"modification_date": "2017-11-08",
				"modification_comment": "updated Demonstrative_Examples, Modes_of_Introduction, Relationships"
			},
			{
				"modification_name": "CWE Content Team",
				"modification_organization": "MITRE",
				"modification_date": "2019-06-20",
				"modification_comment": "updated Related_Attack_Patterns, Type"
			},
			{
				"modification_name": "CWE Content Team",
				"modification_organization": "MITRE",
				"modification_date": "2019-09-19",
				"modification_comment": "updated Relationships"
			},
			{
				"modification_name": "CWE Content Team",
				"modification_organization": "MITRE",
				"modification_date": "2020-02-24",
				"modification_comment": "updated Potential_Mitigations, Relationships"
			},
			{
				"modification_name": "CWE Content Team",
				"modification_organization": "MITRE",
				"modification_date": "2020-06-25",
				"modification_comment": "updated Potential_Mitigations"
			},
			{
				"modification_name": "CWE Content Team",
				"modification_organization": "MITRE",
				"modification_date": "2020-08-20",
				"modification_comment": "updated Relationships"
			},
			{
				"modification_name": "CWE Content Team",
				"modification_organization": "MITRE",
				"modification_date": "2021-03-15",
				"modification_comment": "updated Demonstrative_Examples"
			},
			{
				"modification_name": "CWE Content Team",
				"modification_organization": "MITRE",
				"modification_date": "2021-07-20",
				"modification_comment": "updated Relationships"
			},
			{
				"modification_name": "CWE Content Team",
				"modification_organization": "MITRE",
				"modification_date": "2021-10-28",
				"modification_comment": "updated Relationships"
			},
			{
				"modification_name": "CWE Content Team",
				"modification_organization": "MITRE",
				"modification_date": "2022-04-28",
				"modification_comment": "updated Research_Gaps"
			},
			{
				"modification_name": "CWE Content Team",
				"modification_organization": "MITRE",
				"modification_date": "2022-06-28",
				"modification_comment": "updated Observed_Examples, Relationships"
			},
			{
				"modification_name": "CWE Content Team",
				"modification_organization": "MITRE",
				"modification_date": "2022-10-13",
				"modification_comment": "updated Observed_Examples"
			},
			{
				"modification_name": "CWE Content Team",
				"modification_organization": "MITRE",
				"modification_date": "2023-01-31",
				"modification_comment": "updated Demonstrative_Examples, Description, Potential_Mitigations, Relationships"
			},
			{
				"modification_name": "CWE Content Team",
				"modification_organization": "MITRE",
				"modification_date": "2023-04-27",
				"modification_comment": "updated Demonstrative_Examples, Detection_Factors, Relationships, Time_of_Introduction"
			},
			{
				"modification_name": "CWE Content Team",
				"modification_organization": "MITRE",
				"modification_date": "2023-06-29",
				"modification_comment": "updated Mapping_Notes, Relationships, Taxonomy_Mappings"
			},
			{
				"modification_name": "CWE Content Team",
				"modification_organization": "MITRE",
				"modification_date": "2024-02-29",
				"modification_comment": "updated Demonstrative_Examples, Potential_Mitigations, References"
			},
			{
				"modification_name": "CWE Content Team",
				"modification_organization": "MITRE",
				"modification_date": "2024-07-16",
				"modification_comment": "updated Applicable_Platforms, Observed_Examples"
			}
		],
		"previous_entry_name": [
			{
				"text": "Code Injection",
				"date": "2009-01-12"
			},
			{
				"text": "Failure to Control Generation of Code (aka 'Code Injection')",
				"date": "2009-05-27"
			},
			{
				"text": "Failure to Control Generation of Code ('Code Injection')",
				"date": "2011-03-29"
			}
		],
		"contribution": [
			{
				"type": "Content",
				"contribution_name": "\"Mapping CWE to 62443\" Sub-Working Group",
				"contribution_organization": "CWE-CAPEC ICS/OT SIG",
				"contribution_date": "2023-06-29",
				"contribution_comment": "Suggested mappings to ISA/IEC 62443."
			},
			{
				"type": "Content",
				"contribution_name": "Abhi Balakrishnan",
				"contribution_date": "2024-02-29",
				"contribution_comment": "Provided diagram to improve CWE usability"
			}
		]
	},
	"detection_methods": [
		{
			"detection_method_id": "DM-14",
			"method": "Automated Static Analysis",
			"description": "Automated static analysis, commonly referred to as Static Application Security Testing (SAST), can find some instances of this weakness by analyzing source code (or binary/compiled code) without having to execute it. Typically, this is done by building a model of data flow and control flow, then searching for potentially-vulnerable patterns that connect \"sources\" (origins of input) with \"sinks\" (destinations where the data interacts with external components, a lower layer such as the OS, etc.)",
			"effectiveness": "High"
		}
	],
	"taxonomy_mappings": [
		{
			"taxonomy_name": "PLOVER",
			"entry_name": "Code Evaluation and Injection",
			"entry_id": "CODE"
		},
		{
			"taxonomy_name": "ISA/IEC 62443",
			"entry_name": "Req CR 3.5",
			"entry_id": "Part 4-2"
		},
		{
			"taxonomy_name": "ISA/IEC 62443",
			"entry_name": "Req SR 3.5",
			"entry_id": "Part 3-3"
		},
		{
			"taxonomy_name": "ISA/IEC 62443",
			"entry_name": "Req SVV-1",
			"entry_id": "Part 4-1"
		},
		{
			"taxonomy_name": "ISA/IEC 62443",
			"entry_name": "Req SVV-3",
			"entry_id": "Part 4-1"
		}
	],
	"related_attack_patterns": [
		"242",
		"35",
		"77"
	]
}
