{
	"id": "1194",
	"name": "Hardware Design",
	"type": "Graph",
	"status": "Draft",
	"objective": "This view organizes weaknesses around concepts that are frequently used or encountered in hardware design. Accordingly, this view can align closely with the perspectives of designers, manufacturers, educators, and assessment vendors. It provides a variety of categories that are intended to simplify navigation, browsing, and mapping.",
	"audience": [
		{
			"type": "Hardware Designers",
			"description": "Hardware Designers use this view to better understand potential mistakes that can be made in specific areas of their IP design. The use of concepts with which hardware designers are familiar makes it easier to navigate."
		},
		{
			"type": "Educators",
			"description": "Educators use this view to teach future professionals about the types of mistakes that are commonly made in hardware design."
		}
	],
	"members": [
		{
			"cweid": "1195",
			"view_id": "1194"
		},
		{
			"cweid": "1196",
			"view_id": "1194"
		},
		{
			"cweid": "1197",
			"view_id": "1194"
		},
		{
			"cweid": "1198",
			"view_id": "1194"
		},
		{
			"cweid": "1199",
			"view_id": "1194"
		},
		{
			"cweid": "1201",
			"view_id": "1194"
		},
		{
			"cweid": "1202",
			"view_id": "1194"
		},
		{
			"cweid": "1203",
			"view_id": "1194"
		},
		{
			"cweid": "1205",
			"view_id": "1194"
		},
		{
			"cweid": "1206",
			"view_id": "1194"
		},
		{
			"cweid": "1207",
			"view_id": "1194"
		},
		{
			"cweid": "1208",
			"view_id": "1194"
		},
		{
			"cweid": "1388",
			"view_id": "1194"
		}
	],
	"notes": [
		{
			"type": "Other",
			"text": "The top level categories in this view represent commonly understood areas/terms within hardware design, and are meant to aid the user in identifying potential related weaknesses. It is possible for the same weakness to exist within multiple different categories."
		},
		{
			"type": "Other",
			"text": "This view attempts to present weaknesses in a simple and intuitive way. As such it targets a single level of abstraction. It is important to realize that not every CWE will be represented in this view. High-level class weaknesses and low-level variant weaknesses are mostly ignored. However, by exploring the weaknesses that are included, and following the defined relationships, one can find these higher and lower level weaknesses."
		}
	],
	"content_history": {
		"submission": {
			"submission_name": "CWE Content Team",
			"submission_organization": "MITRE",
			"submission_date": "2019-12-27"
		},
		"modification": [
			{
				"modification_name": "CWE Content Team",
				"modification_organization": "MITRE",
				"modification_date": "2022-06-28",
				"modification_comment": "updated Relationships"
			},
			{
				"modification_name": "CWE Content Team",
				"modification_organization": "MITRE",
				"modification_date": "2023-06-29",
				"modification_comment": "updated Mapping_Notes"
			}
		]
	}
}
